Config/Catalogs/КонтрольныеСоотношения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КонтрольныеСоотношения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказателиТекущегоОтчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСоотношения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дополнительное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПояснения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрольногоСоотношения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрольногоСоотношения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщенияФЛК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НедопустимоеФЛК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИзменятьПриЗагрузкеКомплекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/СтрокиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтрокиОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРаскрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыРаскрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ГруппыРаскрытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыРаскрытия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазрешитьСовпаденияИзмерений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Аналитика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ПоказателиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПоказателиОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидИтога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИтоговПоказателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРаскрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыРаскрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФинансовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеМасштабируется</Name>
					<Comment>Точность отображения показателя не зависит от точности отображения документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеограниченнаяДлина</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПромежуточныеИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньТочностиПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальнаяТочность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/КолонкиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КолонкиОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/КонтрольныеСоотношения/Forms/ФормаНастройкаСтруктурыФЛК/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Параметры.Свойство("ВидОтчета",ВидОтчета);
	Параметры.Свойство("АдресТаблицыНастройки",АдресТаблицыНастройки);
	Параметры.Свойство("КодыСтрокОтчета",КодыСтрокОтчета);

	УстановитьВидимостьВидОтчета();
	УстановитьГруппуРаскрытия();
	ЗаполнитьДеревоЭлементов();
	ЗаполнитьДеревоШапкиРаздела();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	
	ОбновитьФормуПоВидуОтчета();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоШапкиРаздела

&НаКлиенте
Процедура ДеревоШапкиРазделаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НЕ Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоШапкиРазделаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура") Тогда
		ТекСтрока = ПараметрыПеретаскивания.Значение;
		СтандартнаяОбработка = Ложь;	
		                        
		ЭлементПрисутствует = Ложь;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ВидКлассификатораБК) Тогда
			ЕстьЭлементОтчета(ДеревоШапкиРаздела,ТекСтрока.ЭлементОтчета,ТекСтрока.РеквизитЭлемента,ЭлементПрисутствует);
			
			Если ЭлементПрисутствует = Истина Тогда
				Возврат;
			КонецЕсли;                                       
		КонецЕсли;
		
		Если ЭлементПрисутствует = Истина Тогда
			Возврат;
		КонецЕсли;                                       
				
		НовыйЭлемент=ДеревоШапкиРаздела.Добавить();	
		ЗаполнитьЗначенияСвойств(НовыйЭлемент,ТекСтрока);
		
		Если ТекСтрока.КоличествоСимволов Тогда 
			НовыйЭлемент.ПредставлениеПустого = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("0",ТекСтрока.КоличествоСимволов);
		КонецЕсли;
		
		
		НовыйЭлемент.ВидЭлемента		= 0;

		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоШапкиРазделаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура") Тогда	
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазделаНачалоОтбораПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоШапкиРаздела.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	                                         
	ОписаниеСтрокиПоИндексу(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура РазделаКонецОтбораПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоШапкиРаздела.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеСтрокиПоИндексу(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЭлементов

&НаКлиенте
Процедура ДеревоЭлементовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = ДеревоЭлементов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ВидЭлемента = "Данные";
	ИмяГруппы = "";
	ТипТекЭлемента = ТипЗнч(ТекСтрока.ЭлементОтчета);
	Если ТипТекЭлемента = Тип("Строка") И ТекСтрока.ПолучитьРодителя() = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипТекЭлемента = Тип("Строка") И ТекСтрока.ПолучитьРодителя().ЭлементОтчета="Параметры" Тогда
		ВидЭлемента = "Па.";
		ИмяГруппы = "Параметр";
	ИначеЕсли ТипТекЭлемента = Тип("ПланВидовХарактеристикСсылка.АналитикаОтчетов") Тогда
		ВидЭлемента = "Ан.";
		ИмяГруппы = "Аналитика";
	ИначеЕсли ТипТекЭлемента = Тип("СправочникСсылка.КолонкиОтчетов") Тогда
		ВидЭлемента = "Гр.";
		ИмяГруппы = "Показатель";
	Иначе 
		Возврат;
	КонецЕсли;
	
	ЭлементПрисутствует = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ТекСтрока.ВидКлассификатораБК) Тогда
		ЕстьЭлементОтчета(ДеревоШапкиРаздела,ТекСтрока.ЭлементОтчета,ТекСтрока.РеквизитЭлемента,ЭлементПрисутствует);
	
		Если ЭлементПрисутствует = Истина Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	ЕстьЭлементОтчета(ДеревоШапкиРаздела,ТекСтрока.ЭлементОтчета,ТекСтрока.РеквизитЭлемента,ЭлементПрисутствует);
	
	Если ЭлементПрисутствует = Истина Тогда
		Возврат;
	КонецЕсли;

	ЗаголовокЭлемента = "";
	Если ЗначениеЗаполнено(ТекСтрока.РеквизитЭлемента) Тогда
		ЗаголовокЭлемента = ВидЭлемента +": "+ТекСтрока.ПолучитьРодителя().Заголовок + " ["+ТекСтрока.РеквизитЭлемента+"]"; 
	Иначе
		ЗаголовокЭлемента = ВидЭлемента +": " + ТекСтрока.Заголовок;
	КонецЕсли;
	
	НовыйЭлемент=ДеревоШапкиРаздела.Добавить();	
	НовыйЭлемент.ЭлементОтчета		= ТекСтрока.ЭлементОтчета;
	НовыйЭлемент.РеквизитЭлемента	= ТекСтрока.РеквизитЭлемента;
	НовыйЭлемент.Заголовок			= ЗаголовокЭлемента;
	НовыйЭлемент.ИмяГруппы			= ИмяГруппы;
	НовыйЭлемент.КоличествоСимволов	= ТекСтрока.КоличествоСимволов;
	НовыйЭлемент.ПредставлениеРеквизита	= Сред(ЗаголовокЭлемента,СтрНайти(ЗаголовокЭлемента,":")+1);
	НовыйЭлемент.ВидЭлемента		= 0;
	
	Если ТекСтрока.КоличествоСимволов Тогда
		НовыйЭлемент.ПредставлениеПустого = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("0",ТекСтрока.КоличествоСимволов);
	КонецЕсли;
	
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЕстьЭлементОтчета(ПроверяемыйЭлементДерева,ИскомыйЭлементОтчета,РеквизитЭлемента,ЭлементПрисутствует)
	
	Для Каждого ТекЭлемент Из ПроверяемыйЭлементДерева Цикл
		Если ТекЭлемент.ЭлементОтчета = ИскомыйЭлементОтчета 
			И ТекЭлемент.РеквизитЭлемента = РеквизитЭлемента 
			И ТекЭлемент.РеквизитЭлемента <> "Код" Тогда
			Элементы.ДеревоШапкиРаздела.ТекущаяСтрока = ТекЭлемент.ПолучитьИдентификатор();
			ЭлементПрисутствует = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭлементовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекСтрока       = ПараметрыПеретаскивания.Значение;
	
	СтрокаПеретаскивания = ДеревоЭлементов.НайтиПоИдентификатору(ТекСтрока);
	ВидЭлемента = "Данные";
	ИмяГруппы = "";
	ТипТекЭлемента = ТипЗнч(СтрокаПеретаскивания.ЭлементОтчета);
	Если ТипТекЭлемента = Тип("Строка") И СтрокаПеретаскивания.ПолучитьРодителя() = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипТекЭлемента = Тип("Строка") И СтрокаПеретаскивания.ПолучитьРодителя().ЭлементОтчета="Параметры" Тогда
		ВидЭлемента = "Па.";
		ИмяГруппы = "Параметр";
	ИначеЕсли ТипТекЭлемента = Тип("ПланВидовХарактеристикСсылка.АналитикаОтчетов") Тогда
		ВидЭлемента = "Ан.";
		ИмяГруппы = "Аналитика";
	ИначеЕсли ТипТекЭлемента = Тип("СправочникСсылка.КолонкиОтчетов") Тогда
		ВидЭлемента = "Гр.";
		ИмяГруппы = "Показатель";
	Иначе 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаПеретаскивания.ЭлементОтчета) Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	
	РодительСтроки = СтрокаПеретаскивания.ПолучитьРодителя();

	Если ЗначениеЗаполнено(СтрокаПеретаскивания.РеквизитЭлемента) Тогда
		ЗаголовокЭлемента =  ВидЭлемента +": "+РодительСтроки.Заголовок + " ["+СтрокаПеретаскивания.РеквизитЭлемента+"]"; 
	Иначе
		ЗаголовокЭлемента = ВидЭлемента +": " + СтрокаПеретаскивания.Заголовок;
	КонецЕсли;
	
	СтруктураЗначения = Новый Структура("ЭлементОтчета,РеквизитЭлемента");
	ЗаполнитьЗначенияСвойств(СтруктураЗначения,СтрокаПеретаскивания);
	СтруктураЗначения.Вставить("Заголовок",ЗаголовокЭлемента);
	СтруктураЗначения.Вставить("ИмяГруппы",ИмяГруппы);
	СтруктураЗначения.Вставить("КоличествоСимволов",СтрокаПеретаскивания.КоличествоСимволов);
	СтруктураЗначения.Вставить("ПредставлениеРеквизита",СтрокаПеретаскивания.Заголовок);
	СтруктураЗначения.Вставить("ВидКлассификатораБК",СтрокаПеретаскивания.ВидКлассификатораБК);

	ПараметрыПеретаскивания.Значение = СтруктураЗначения;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьНастройкуШапки(Команда)
	
	Отказ = Ложь;
	
	Отказ = ОшибкиШапкиРаздела();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьТаблицуИзДерева();
	
	Оповестить("ИзмененаСтруктураАналитикиФЛК",Новый Структура("АдресТаблицыНастройки",АдресТаблицыНастройки),ЭтаФорма.ВладелецФормы);
	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоЭлементов()
	
	ДеревоЭлементов.ПолучитьЭлементы().Очистить();
			
	КодыСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КодыСтрокОтчета,";");
	
	Запрос = ПолучитьЗапросКАналитикиИКолонки(КодыСтрок);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	//Аналитика отчета
	Если ЗначениеЗаполнено(ГруппаРаскрытия) Тогда
		ЗаполнитьДеревоЭлементовАналитикой(Результаты);
	КонецЕсли;

	//Колонки отчета
	ЗаполнитьДеревоЭлементовКолонки(Результаты);
	
	//Параметры отчета
	ЗаполнитьДеревоЭлементовПараметры();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗапросКАналитикиИКолонки(Знач КодыСтрок)
	
	Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	Запрос.УстановитьПараметр("СтрокиОтчета", КодыСтрок);
	Запрос.УстановитьПараметр("ГруппаРаскрытия", ГруппаРаскрытия);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыРаскрытияАналитика.ВидАналитики КАК ВидАналитики,
	|	ГруппыРаскрытияАналитика.ВидАналитики.ТипЗначения КАК ТипЗначенияАналитики,
	|	ГруппыРаскрытияАналитика.ВидАналитики.Код КАК КодВидаАналитики,
	|	ГруппыРаскрытияАналитика.ВидАналитики.Наименование КАК НаименованиеВидаАналитики,
	|	ГруппыРаскрытияАналитика.Ссылка КАК ГруппаРаскрытия,
	|	ГруппыРаскрытияАналитика.НомерСтроки КАК НомерСтроки,
	|	ГруппыРаскрытияАналитика.Ссылка.Наименование КАК Наименование,
	|	ГруппыРаскрытияАналитика.НомерСтроки КАК Код,
	|	ГруппыРаскрытияАналитика.ВидАналитики.ВидКлассификатораБК КАК ВидКлассификатораБК
	|ИЗ
	|	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
	|		ПО СтрокиОтчетов.ГруппаРаскрытия = ГруппыРаскрытияАналитика.Ссылка
	|ГДЕ
	|	ГруппыРаскрытияАналитика.Ссылка = &ГруппаРаскрытия
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтрокиОтчетов.ГруппаРаскрытия.Наименование,
	|	НомерСтроки
	|ИТОГИ ПО
	|	ГруппаРаскрытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(КолонкиОтчетов.Ссылка) КАК Заголовок,
	|	КолонкиОтчетов.Ссылка КАК КолонкаОтчета,
	|	КолонкиОтчетов.Код
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоказателиОтчетов.Колонка КАК Колонка
	|	ИЗ
	|		Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтрокиОтчетов КАК СтрокиОтчетов
	|			ПО ПоказателиОтчетов.Строка = СтрокиОтчетов.Ссылка
	|	ГДЕ
	|		СтрокиОтчетов.Код В(&СтрокиОтчета)
	|		И СтрокиОтчетов.Владелец = &Владелец) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КолонкиОтчетов КАК КолонкиОтчетов
	|		ПО ВложенныйЗапрос.Колонка = КолонкиОтчетов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	КолонкиОтчетов.ПорядковыйНомер";
	Возврат Запрос;

КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоЭлементовАналитикой(Знач Результаты)
	
	Перем АналитикаОтчета, ВыборкаАналитики, ВыборкаГР, СтрокаДерева, ТекГР;
	
	ВыборкаГР = Результаты[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	АналитикаОтчета = ДеревоЭлементов.ПолучитьЭлементы().Добавить();
	АналитикаОтчета.ЭлементОтчета = "Аналитика строки";
	
	Пока ВыборкаГР.Следующий() Цикл
		
		ТекГР=АналитикаОтчета.ПолучитьЭлементы().Добавить();
		ТекГР.ЭлементОтчета = ВыборкаГР.Наименование;
		ВыборкаАналитики	= ВыборкаГР.Выбрать();
		Пока ВыборкаАналитики.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаАналитики.ВидАналитики) Тогда
				
				СтрокаДерева=ТекГР.ПолучитьЭлементы().Добавить();
				СтрокаДерева.ЭлементОтчета	= ВыборкаАналитики.ВидАналитики;
				СтрокаДерева.Заголовок		= Строка(ВыборкаАналитики.НаименованиеВидаАналитики);
				СтрокаДерева.КодЭлемента	= СокрЛП(ВыборкаАналитики.Код);
				СтрокаДерева.ВидКлассификатораБК	= ВыборкаАналитики.ВидКлассификатораБК;
				
				Если НЕ ЗначениеЗаполнено(ВыборкаАналитики.ВидКлассификатораБК) Тогда
					ДобавитьРеквизитыПоТипу(СтрокаДерева,ВыборкаАналитики.ТипЗначенияАналитики);
				Иначе
					РеквизитыАналитики = Новый Структура("ТипЗначения,ВидКлассификатораБК",ВыборкаАналитики.ТипЗначенияАналитики,ВыборкаАналитики.ВидКлассификатораБК);
					СтрокаДерева.КоличествоСимволов = Метаданные.НайтиПоТипу(БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(ВыборкаАналитики.ВидАналитики,РеквизитыАналитики).Типы()[0]).ДлинаКода;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ТекГР.ПолучитьЭлементы().Количество() = 0 Тогда
			АналитикаОтчета.ПолучитьЭлементы().Удалить(ТекГР);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЭлементовКолонки(Знач Результаты)
	
	Перем ВыборкаГр, КолонкиОтчета, НомерСтроки, ТекКолонкаОтчета;
	
	ВыборкаГр = Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КолонкиОтчета = ДеревоЭлементов.ПолучитьЭлементы().Добавить();
	
	Если ЗначениеЗаполнено(ГруппаРаскрытия) Тогда
		КолонкиОтчета.ЭлементОтчета = "Колонки строки";
	Иначе
		КолонкиОтчета.ЭлементОтчета = "Колонки строк";
	КонецЕсли;
	
	Пока ВыборкаГр.Следующий() Цикл
		ТекКолонкаОтчета = КолонкиОтчета.ПолучитьЭлементы().Добавить();
		ТекКолонкаОтчета.ЭлементОтчета = ВыборкаГр.КолонкаОтчета;
		Если ЗначениеЗаполнено(ВыборкаГр.Заголовок) Тогда
			ТекКолонкаОтчета.Заголовок = ВыборкаГр.Заголовок;
		Иначе
			ТекКолонкаОтчета.Заголовок = Строка(ВыборкаГр.КолонкаОтчета);
		КонецЕсли;
		ТекКолонкаОтчета.КодЭлемента	= ВыборкаГр.Код;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЭлементовПараметры()
	
	Перем ПараметрОтчета, ПараметрыОтчета;
	
	ПараметрыОтчета = ДеревоЭлементов.ПолучитьЭлементы().Добавить();
	ПараметрыОтчета.ЭлементОтчета = "Параметры";
	
	ПараметрОтчета = ПараметрыОтчета.ПолучитьЭлементы().Добавить();
	ПараметрОтчета.ЭлементОтчета = "ГлаваПоБК";
	ПараметрОтчета.Заголовок = "Глава по БК";

КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыПоТипу(СтрокаДерева,ТипЗначенияАналитики)
	ТипОбъекта =  ТипЗначенияАналитики.Типы()[0];
	Если ОбщегоНазначения.ЭтоСсылка(ТипОбъекта) Тогда	
		ТекОбъект = Метаданные.НайтиПоТипу(ТипОбъекта);
		Если ОбщегоНазначения.ЭтоПеречисление(ТекОбъект) Тогда
			Возврат;
		КонецЕсли;

		Если ТекОбъект.Имя = "ЕПСБУ" Тогда	

			НовРеквизит = СтрокаДерева.ПолучитьЭлементы().Добавить();
			НовРеквизит.ЭлементОтчета = СтрокаДерева.ЭлементОтчета;
			НовРеквизит.Заголовок = "Код";
			НовРеквизит.РеквизитЭлемента = "Код";
			НовРеквизит.КоличествоСимволов = 5;
			Возврат;
		КонецЕсли;
		
		МассивРеквизитов = БюджетнаяОтчетность.ПолучитьДопустимыеРеквизитыАналитикиПоТипу(ТипОбъекта);
		Если МассивРеквизитов = Неопределено Тогда
			Если ТекОбъект.ДлинаКода>0 Тогда
				НовРеквизит = СтрокаДерева.ПолучитьЭлементы().Добавить();
				НовРеквизит.ЭлементОтчета = СтрокаДерева.ЭлементОтчета;
				НовРеквизит.Заголовок = "Код";
				НовРеквизит.РеквизитЭлемента = "Код";
				НовРеквизит.КоличествоСимволов = ТекОбъект.ДлинаКода;
			КонецЕсли;
			Если ТекОбъект.ДлинаНаименования>0 Тогда
				НовРеквизит = СтрокаДерева.ПолучитьЭлементы().Добавить();
				НовРеквизит.ЭлементОтчета = СтрокаДерева.ЭлементОтчета;
				НовРеквизит.Заголовок = "Наименование";
				НовРеквизит.РеквизитЭлемента = "Наименование";
				НовРеквизит.КоличествоСимволов = ТекОбъект.ДлинаНаименования;
			КонецЕсли;
			Возврат;
		КонецЕсли;		
		Для Каждого РеквизитаЗначения из МассивРеквизитов Цикл
			Если РеквизитаЗначения = "Код"  Тогда 
				Если ТекОбъект.ДлинаКода>0 Тогда
					НовРеквизит = СтрокаДерева.ПолучитьЭлементы().Добавить();
					НовРеквизит.ЭлементОтчета = СтрокаДерева.ЭлементОтчета;
					НовРеквизит.Заголовок = "Код";
					НовРеквизит.РеквизитЭлемента = "Код";
					НовРеквизит.КоличествоСимволов = ТекОбъект.ДлинаКода;
				КонецЕсли;
			ИначеЕсли РеквизитаЗначения = "Наименование" Тогда
				Если ТекОбъект.ДлинаНаименования>0 Тогда
					НовРеквизит = СтрокаДерева.ПолучитьЭлементы().Добавить();
					НовРеквизит.ЭлементОтчета = СтрокаДерева.ЭлементОтчета;
					НовРеквизит.Заголовок = "Наименование";
					НовРеквизит.РеквизитЭлемента = "Наименование";
					НовРеквизит.КоличествоСимволов = ТекОбъект.ДлинаНаименования;
				КонецЕсли;
			Иначе
				РеквОбъекта=ТекОбъект.Реквизиты[РеквизитаЗначения];
				НовРеквизит=СтрокаДерева.ПолучитьЭлементы().Добавить();
				НовРеквизит.ЭлементОтчета		= СтрокаДерева.ЭлементОтчета;
				НовРеквизит.Заголовок			= РеквизитаЗначения;
				НовРеквизит.РеквизитЭлемента	= РеквизитаЗначения;
				Если РеквОбъекта.Тип.Типы()[0] = Тип("Строка") Тогда
					НовРеквизит.КоличествоСимволов = РеквОбъекта.Тип.КвалификаторыСтроки.Длина;
				ИначеЕсли РеквОбъекта.Тип.Типы()[0] = Тип("Число") Тогда
					НовРеквизит.КоличествоСимволов = РеквОбъекта.Тип.КвалификаторыЧисла.Разрядность;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьГруппуРаскрытия()	
	
	ТаблицаНастройки = ПолучитьИзВременногоХранилища(АдресТаблицыНастройки);
	Если НЕ ТипЗнч(ТаблицаНастройки) = Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ТаблицаНастройки.Количество() Тогда
		Возврат;
	КонецЕсли;

	ГруппаРаскрытия = ТаблицаНастройки[0].ГруппаРаскрытия;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоШапкиРаздела()
	
	ДеревоШапкиРаздела.Очистить();

	ТаблицаНастройки = ПолучитьИзВременногоХранилища(АдресТаблицыНастройки);
	Если НЕ ТипЗнч(ТаблицаНастройки) = Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ТаблицаНастройки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	АналитикаПоГруппамРаскрытия = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикПоГруппамРаскрытия(ВидОтчета);
	
	ТекДеревоЭлементов = РеквизитФормыВЗначение("ДеревоЭлементов");
	
	Для Каждого СтрокаШапки из ТаблицаНастройки Цикл
		
		ЧастиПутиРеквизита = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаШапки.ПолныйПутьРеквизита,".");
		Если ЧастиПутиРеквизита.Количество() < 2 Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементОтчета = "";
		ИмяГруппы = ЧастиПутиРеквизита[0];
		Если ИмяГруппы = "Аналитика" Тогда 
			ВидЭлемента = "Ан.";
			ЭлементОтчета = АналитикаПоГруппеРаскрытияИКоду(ГруппаРаскрытия, ЧастиПутиРеквизита[1], АналитикаПоГруппамРаскрытия); 
		ИначеЕсли ИмяГруппы = "Показатель" Тогда
			ВидЭлемента = "Гр.";
			ЭлементОтчета = КолонкаОтчетаПоКоду(ВидОтчета, ЧастиПутиРеквизита[1]);
		Иначе 
			ВидЭлемента = "Па.";
			ЭлементОтчета = ЧастиПутиРеквизита[1];
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭлементОтчета) Тогда 
			Продолжить;
		КонецЕсли;
		
		ТекГруппа = ДеревоШапкиРаздела.Добавить();		
		ЗаполнитьЗначенияСвойств(ТекГруппа,СтрокаШапки,"ПредставлениеПустого,НачалоОтбора,КонецОтбора,ПредставлениеРеквизита");

		//3-й элемент массива Реквизит аналитики
		Если ЧастиПутиРеквизита.Количество() = 3 Тогда
			Если ТипЗнч(ЭлементОтчета) = Тип("ПланВидовХарактеристикСсылка.АналитикаОтчетов") Тогда
				Если НЕ ЗначениеЗаполнено(ЭлементОтчета.ВидКлассификатораБК) Тогда
					ТекГруппа.РеквизитЭлемента = ЧастиПутиРеквизита[2];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ТекГруппа.ЭлементОтчета  = ЭлементОтчета; //Ссылка на элемента если это Аналитика или Показатель
		
		Если ВидЭлемента = "Па." Тогда
			ТекГруппа.Заголовок = ВидЭлемента +": " + ЭлементОтчета;
		Иначе
			СтрокиДерева = ТекДеревоЭлементов.Строки.НайтиСтроки(Новый Структура("ЭлементОтчета,РеквизитЭлемента",ТекГруппа.ЭлементОтчета,""),Истина);
			Если СтрокиДерева.Количество() Тогда
				ТекГруппа.Заголовок = ВидЭлемента +": " + СтрокиДерева[0].Заголовок 
				+ ?(ЗначениеЗаполнено(ТекГруппа.РеквизитЭлемента)," ["+ТекГруппа.РеквизитЭлемента+"]","")
				+ ?(ЗначениеЗаполнено(ТекГруппа.НачалоОтбора)," : ["+ТекГруппа.НачалоОтбора +" - "+ТекГруппа.КонецОтбора+"]","");
			КонецЕсли;
			СтрокиДерева = ТекДеревоЭлементов.Строки.НайтиСтроки(Новый Структура("ЭлементОтчета,РеквизитЭлемента",ТекГруппа.ЭлементОтчета,ТекГруппа.РеквизитЭлемента),Истина);
			Если СтрокиДерева.Количество() Тогда
				ТекГруппа.КоличествоСимволов = СтрокиДерева[0].КоличествоСимволов;
			КонецЕсли;
		КонецЕсли;
		ТекГруппа.ИмяГруппы = ИмяГруппы;
		
		Если ТекГруппа.КоличествоСимволов Тогда
			ЗадатьОписаниеИнтервалаСтроки(ТекГруппа);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КолонкаОтчетаПоКоду(ВидОтчета, КодКолонки)
	
	КолонкаОтчета = Справочники.КолонкиОтчетов.НайтиПоКоду(КодКолонки,,,ВидОтчета);
	
	Возврат КолонкаОтчета;
КонецФункции

&НаСервереБезКонтекста
Функция АналитикаПоГруппеРаскрытияИКоду(ГруппаРаскрытия, КодАналитики, ТаблицаАналитик) 
		
	Отбор = Новый Структура;
	Отбор.Вставить("КодВидаАналитики",КодАналитики);
	Отбор.Вставить("ГруппаРаскрытия",ГруппаРаскрытия);
	НайденнаяСтрока = ТаблицаАналитик.НайтиСтроки(Отбор);
	
	Если НайденнаяСтрока.Количество() Тогда
		Возврат НайденнаяСтрока[0].ВидАналитики;
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ОбновитьФормуПоВидуОтчета()
	
	ДеревоЭлементов.ПолучитьЭлементы().Очистить();
	ДеревоШапкиРаздела.Очистить();
	
	ЗаполнитьДеревоЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВидОтчета()
	Элементы.ВидОтчета.Видимость = Не ЗначениеЗаполнено(ВидОтчета);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИзДерева()
	
	ТаблицаНастройки = ПолучитьИзВременногоХранилища(АдресТаблицыНастройки);
	
	Если НЕ ТаблицаНастройки.Количество() Тогда
		Возврат;
	КонецЕсли;

	АналитикаРаскрытия	= ТаблицаНастройки.СкопироватьКолонки();
	
	ЗаполнитьНастройкиВыходнойТаблицы(АналитикаРаскрытия);	
	ПоместитьВоВременноеХранилище(АналитикаРаскрытия,АдресТаблицыНастройки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиВыходнойТаблицы(АналитикаРаскрытия)
	
	НастройкаЭлементов	= РеквизитФормыВЗначение("ДеревоЭлементов");
	
	Для Каждого СтрокаШапки из ДеревоШапкиРаздела Цикл
		
		СтрокаАналитикРаскрытия = АналитикаРаскрытия.Добавить();
		ТипРеквизита = СтрокаШапки.ИмяГруппы;
		ИмяРеквизита = ТипРеквизита;
		
		РеквизитЭлемента = ?(ЗначениеЗаполнено(СтрокаШапки.РеквизитЭлемента),СтрокаШапки.РеквизитЭлемента,"");
		Если ТипРеквизита = "Параметр" Тогда
			СтрокаАналитикРаскрытия.ПолныйПутьРеквизита		= ТипРеквизита+"."+СтрокаШапки.ЭлементОтчета;
			ИмяРеквизита									= ИмяРеквизита+"_"+СтрокаШапки.ЭлементОтчета;
		Иначе 
			СтрокаАналитикРаскрытия.ПолныйПутьРеквизита		= ТипРеквизита+"."+СтрокаШапки.ЭлементОтчета.Код
														  		+?(ЗначениеЗаполнено(РеквизитЭлемента),"."+РеквизитЭлемента,"");
			ИмяРеквизита									= ИмяРеквизита+"_"+СтрокаШапки.ЭлементОтчета.Код
																+?(ЗначениеЗаполнено(РеквизитЭлемента),"_"+РеквизитЭлемента,"");; 
		КонецЕсли;
		
		СтрокаАналитикРаскрытия.ПредставлениеРеквизита  = ?(ПустаяСтрока(СтрокаШапки.ПредставлениеРеквизита)
															,Сред(СтрокаШапки.Заголовок,6)
															,СтрокаШапки.ПредставлениеРеквизита);
															
		Если ТипРеквизита = "Показатель" Тогда
			СтрокаАналитикРаскрытия.ТипЗначения  			= СтрокаШапки.ЭлементОтчета.ТипЗначения;
		КонецЕсли;
		СтрокаАналитикРаскрытия.ГруппаРаскрытия  		= ГруппаРаскрытия;
		СтрокаАналитикРаскрытия.ИмяРеквизита			= ИмяРеквизитаПоПредставлению(ИмяРеквизита,СтрокаШапки.НачалоОтбора,СтрокаШапки.КонецОтбора);
		СтрокаАналитикРаскрытия.ПредставлениеПустого	= СтрокаШапки.ПредставлениеПустого;
		СтрокаАналитикРаскрытия.НачалоОтбора			= СтрокаШапки.НачалоОтбора;
		СтрокаАналитикРаскрытия.КонецОтбора				= СтрокаШапки.КонецОтбора;
		СтрокаАналитикРаскрытия.КодыСтрокПроверок		= КодыСтрокОтчета;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяРеквизитаПоПредставлению(Наименнование, НачалоОтбора, КонецОтбора)
	
	Если ЗначениеЗаполнено(НачалоОтбора) Или ЗначениеЗаполнено(КонецОтбора) Тогда 
		Возврат Наименнование+"_"+НачалоОтбора+"_"+КонецОтбора;
	Иначе 
		Возврат Наименнование;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ОшибкиШапкиРаздела()
	
	Отказ = Ложь;
	
	ПредыдущиеЭлементы = Новый ТаблицаЗначений;
	ПредыдущиеЭлементы.Колонки.Добавить("ЭлементОтчета");
	ПредыдущиеЭлементы.Колонки.Добавить("РеквизитЭлемента");
	ПредыдущиеЭлементы.Колонки.Добавить("НачалоОтбора");
	ПредыдущиеЭлементы.Колонки.Добавить("КонецОтбора");

	Для Каждого ЭлементаРаздела из ДеревоШапкиРаздела Цикл
		
		Если Не ЭлементаРаздела.ВидЭлемента = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура();
		Отбор.Вставить("ЭлементОтчета",ЭлементаРаздела.ЭлементОтчета);
		Отбор.Вставить("РеквизитЭлемента",ЭлементаРаздела.РеквизитЭлемента);
		Отбор.Вставить("НачалоОтбора",ЭлементаРаздела.НачалоОтбора);
		Отбор.Вставить("КонецОтбора",ЭлементаРаздела.КонецОтбора);
		
		НайденныеСтроки = ПредыдущиеЭлементы.НайтиСтроки(Отбор);
		
		ИндексСтроки = ЭлементаРаздела.ПолучитьИдентификатор();

		Если НайденныеСтроки.Количество() Тогда
			Отказ = Истина;
			Поле = "ДеревоШапкиРаздела["+ИндексСтроки+"].ИмяГруппы";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
															НСтр("ru = 'Повторяющиеся колонка таблицы: %1.'"), ЭлементаРаздела.Заголовок),,Поле);
		Иначе
			ЗаполнитьЗначенияСвойств(ПредыдущиеЭлементы.Добавить(),ЭлементаРаздела);
		КонецЕсли;
		
		Если ЭлементаРаздела.КонецОтбора > ЭлементаРаздела.КоличествоСимволов И ЗначениеЗаполнено(ЭлементаРаздела.КоличествоСимволов) Тогда
			Отказ = Истина;
			Поле = "ДеревоШапкиРаздела["+ИндексСтроки+"].ОписаниеИнтервала";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
															НСтр("ru = 'Неверно задан интервал: в строке [%1] превышает максимальное количество символов '"),ИндексСтроки+1),,Поле);
		КонецЕсли;
		Если ЭлементаРаздела.НачалоОтбора > ЭлементаРаздела.КонецОтбора Тогда
			Отказ = Истина;
			Поле = "ДеревоШапкиРаздела["+ИндексСтроки+"].ОписаниеИнтервала";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
															НСтр("ru = 'Неверно задан интервал: в строке [%1]  номер первого символа больше номера последнего'"),ИндексСтроки+1),,Поле);
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементаРаздела.РеквизитЭлемента) 
			И ЭлементаРаздела.КонецОтбора <> 0 
			И ЭлементаРаздела.НачалоОтбора = 0 Тогда
			Отказ = Истина;
			Поле = "ДеревоШапкиРаздела["+ИндексСтроки+"].ОписаниеИнтервала";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
															НСтр("ru = 'Неверно задан интервал: в строке [%1] не заполнен номер первого символа '"),ИндексСтроки+1),,Поле);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

&НаСервере
Процедура ЗадатьОписаниеИнтервалаСтроки(СтрокаТаблицы)
	
	Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.КонецОтбора) 
		И НЕ ЗначениеЗаполнено(СтрокаТаблицы.НачалоОтбора) Тогда
		СтрокаТаблицы.ОписаниеИнтервала = "";
	Иначе
		СтрокаТаблицы.ОписаниеИнтервала = "с "+СтрокаТаблицы.НачалоОтбора + " по " 
										+ СтрокаТаблицы.КонецОтбора + " символ из " + СтрокаТаблицы.КоличествоСимволов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОписаниеСтрокиПоИндексу(ИндекcСтроки)
	 ЗадатьОписаниеИнтервалаСтроки(ДеревоШапкиРаздела.НайтиПоИдентификатору(ИндекcСтроки));
КонецПроцедуры

&НаКлиенте
Процедура ДеревоШапкиРазделаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.КоличествоСимволов) Тогда
		Элементы.РазделаНачалоОтбора.Доступность = Ложь;
		Элементы.РазделаКонецОтбора.Доступность = Ложь;
	Иначе
		Элементы.РазделаНачалоОтбора.Доступность = Истина;
		Элементы.РазделаКонецОтбора.Доступность  = Истина;
	КонецЕсли;
	
КонецПроцедуры

	
#КонецОбласти
